back_end/app/controllers/avatars_controller.rb

SELECT "avatars".* FROM "avatars"
---
    def index
        avatars = Avatar.all