back_end/app/controllers/channels_controller.rb

    def index
        channels = Channel.all
---
SELECT "channels".* FROM "channels"

   def create
        channel = Channel.new(channel_params)
        if channel.save
---
INSERT INTO "channels" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "awesomeChat"], ["created_at", "2020-04-09 17:49:29.561861"], ["updated_at", "2020-04-09 17:49:29.561861"]]

   def destroy
        channel = Channel.find(params[:id])
        channel.destroy
---
SELECT "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "channels" WHERE "channels"."id" = $1  [["id", 5]]