back_end/app/controllers/messages_controller.rb

    def index
        messages = Message.all
---
SELECT "messages".* FROM "messages"

    def create
        message = Message.new(message_params)
        if message.save
---
INSERT INTO "messages" ("content", "channel_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "correct issue?"], ["channel_id", 3], ["user_id", 3], ["created_at", "2020-04-14 22:22:27.882727"], ["updated_at", "2020-04-14 22:22:27.882727"]]