back_end/app/controllers/users_controller.rb

    def create
        user = User.new(
            userName: params[:userName],
            password: params[:password],
            latitude: params[:latitude],
            longitude: params[:longitude]
        )
        if user.save
---
INSERT INTO "users" ("userName", "password_digest", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def update
        user = User.find(params[:id])
        user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "users" SET "avatar" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["avatar", "https://www.medievalcollectibles.com/wp-content/uploads/2019/04/FK-11694-300x300.png"], ["updated_at", "2020-04-14 22:08:39.940966"], ["id", 3]]