back_end/app/channels/channel_channel.rb

SELECT "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def subscribed
    channel = Channel.find(params[:id])